# Width Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Wall..::..Width Property
Wall Class See Also
---
Get the overall thickness of the wall.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double Width { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Width As Double
	Get
```

Visual C++
---
```text
public:
property double Width {
	double get ();
}
```

# See Also
Wall Class
Autodesk.Revit.DB Namespace